import numpy as np
import pandas as pd

reader = pd.read_excel("Витрина.xlsx")
data = pd.DataFrame(reader.values[2:, 1:])
data.columns = reader.values[0][1:]

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'LARGE'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Портфель']] = 'Корпы'

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'MIDDLEBIS'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Портфель']] = 'СБ'

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'SMALL') | (data['Бизнес - направление'] == 'MICRO'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Портфель']] = 'МБ'

data.loc[
        (data['Тип клиента'] == 'ИП')
        &
        (data['Индекс кредита'] == 3.0),
        ['Портфель']] = 'ИП'

data.loc[
        (data['Тип клиента'] == 'ИП')
        &
        (data['Индекс кредита'].isin([5.0, 6.0, 7.0, 8.0]))
        &
        (data['Источник финансирования'].isin([2, 3, 5])),
        ['Портфель']] = 'ФЛ ЕБРР'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        data['Индекс кредита'].isin([5.0, 6.0, 7.0, 8.0])
        &
        ~(data['Источник финансирования'].isin([2, 3, 9]))
        ,
        ['Портфель']] = 'Розница'

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'LARGE'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Продукт']] = 'Корпы'

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'MIDDLEBIS'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Продукт']] = 'СБ'

data.loc[
        (data['Тип клиента'] == 'ЮЛ')
        &
        ((data['Бизнес - направление'] == 'SMALL') | (data['Бизнес - направление'] == 'MICRO'))
        &
        (data['Индекс кредита'].isin([1.0, 2.0, 9.0])),
        ['Продукт']] = 'МБ'

data.loc[
        (data['Тип клиента'] == 'ИП')
        &
        (data['Индекс кредита'] == 3.0),
        ['Продукт']] = 'ИП'

data.loc[
        (data['Тип клиента'] == 'ИП')
        &
        (data['Индекс кредита'] >= 5.0)
        &
        (data['Индекс кредита'] <= 8.0)
        &
        data['Источник финансирования'].isin([2, 3, 5])
        ,
        ['Продукт']] = 'ФЛ ЕБРР'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        (data['Индекс кредита'] >= 6.0)
        &
        (data['Индекс кредита'] <= 8.0)
        &
        ~(data['Источник финансирования'].isin([2, 3, 5])),
        ['Продукт']] = 'Ипотека'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        (data['Индекс кредита'] == 5.0)
        &
        ~(data['Источник финансирования'].isin([2, 3, 5]))
        &
        (data['Шифр объекта кредитования'] == 152),
        ['Продукт']] = 'Авто'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        (data['Индекс кредита'] == 5.0)
        &
        ~(data['Источник финансирования'].isin([2, 3, 5]))
        &
        (data['Шифр объекта кредитования'] != 152)
        &
        data['Программа кредитования'].isin(['0.210.2.0271', '0.201.1.0105', '0.201.1.0301', '0.201.1.0302', '0.201.1.0303', '0.201.1.0304'])
        ,['Продукт']] = 'Беззалоговые'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        (data['Индекс кредита'] == 5.0)
        &
        ~(data['Источник финансирования'].isin([2, 3, 5]))
        &
        (data['Программа кредитования'].str.startswith('0.208.'))
        ,['Продукт']] = 'Кредитные карты'

data.loc[
        (data['Тип клиента'] == 'ФЛ')
        &
        (data['Индекс кредита'] == 5.0)
        &
        ~(data['Источник финансирования'].isin([2, 3, 5]))
        &
        (data['Шифр объекта кредитования'] != 152)
        &
        ~(data['Продукт'].isin(['Кредитные карты', 'Программа кредитования']))
        ,['Продукт']] = 'Потребительские'

arr_by_row = [
    ['Корпы'],
    ['СБ'],
    ['МБ'],
    ['ИП', 'ФЛ ЕБРР'],
    ['Ипотека'],
    ['Авто'],
    ['Беззалоговые'],
    ['Потребительские'],
    ['Кредитные карты']
]

date_interval = [
                 ['2020-01-01', '2020-02-01'],
                 ['2020-02-01', '2020-02-15'],
                 ['2020-02-15', '2020-02-22'],
                 ['2020-02-22', '2020-03-01'],
                ]

date_y = [i[0] for i in date_interval]
names_of_product = [i[0] for i in arr_by_row]

count = np.zeros((9, 4))

for i in range(len(arr_by_row)):
    for j in range(len(date_interval)):
        data1 = date_interval[j][0]
        data2 = date_interval[j][1]
        count[i][j] = len(data[
                        (data['Дата портфеля'] >= data1) & (data['Дата портфеля'] < data2)
                        &
                        data['Продукт'].isin(arr_by_row[i])
                     ])

top_10_debtors = data.sort_values(by=['Сумма основного долга'], ascending=False)[:10]
top_10_debtors = top_10_debtors.loc[:, ('Наименование клиента-дебитора', 'Сумма основного долга')]
